#include <iostream>

/*
Игра в пьяницу

В игре в пьяницу карточная колода раздается поровну двум игрокам. Далее они вскрывают по одной верхней карте, и тот, чья карта старше, забирает себе обе, затем они кладутся под низ его колоды. Тот, кто остается без карт – проигрывает.

В колоде все карты одной масти, а самая младшая карта побеждает самую старшую карту ("шестерка берет туза"). 

Пусть в игре участвует `10` карт, имеющих значения от `0` до `9`.

Входные данные:
Программа получает на вход две строки: первая строка содержит 5 чисел, разделенных пробелами — номера карт первого игрока, вторая – аналогично 5 карт второго игрока. Карты перечислены сверху вниз, то есть каждая строка начинается с той карты, которая будет открыта первой.

Выходные данные:
Программа должна определить, кто выигрывает при данной раздаче, и вывести слово first или second, после чего вывести количество ходов, сделанных до выигрыша. Если на протяжении 106 ходов игра не заканчивается, программа должна вывести слово botva.

Примеры:

Входные данные:
1 3 5 7 9
2 4 6 8 0

Выходные данные:
second 5
*/

int main()
{
	using namespace std;


	return 0;
}